Revit 2027 API
Document.FamilyManager Property
The family manager object provides access to family types and parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyManager FamilyManager { get; }
Public ReadOnly Property FamilyManager As FamilyManager
	Get
public:
property FamilyManager^ FamilyManager {
	FamilyManager^ get ();
}
member FamilyManager : FamilyManager with get
Property Value
FamilyManager
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the current document is project document.
Remarks
This property is available when the document is a family document.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace